released/M480BSP_UART1_UART2_PDMA/SampleCode/Template/main.c
/*_____ I N C L U D E S ____________________________________________________*/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

#include "project_config.h"


/*_____ D E C L A R A T I O N S ____________________________________________*/

/*_____ D E F I N I T I O N S ______________________________________________*/
volatile uint32_t BitFlag = 0;
volatile uint32_t counter_tick = 0;

enum
{
    UART1_RX_BUFFER01 = 0,
    UART1_RX_BUFFER02,

    UART2_RX_BUFFER01 = 0,
    UART2_RX_BUFFER02,    
};

typedef struct DMA_DESC_t
{
    uint32_t ctl;
    uint32_t src;
    uint32_t dest;
    uint32_t offset;
} DMA_DESC_t;

DMA_DESC_t DMA_UART1DESC[2];
DMA_DESC_t DMA_UART2DESC[2];

#define ENABLE_UART1
#define ENABLE_UART2

#define UART1_RX_DMA_CH 		    (0)
#define UART2_RX_DMA_CH 		    (1)
#define UART_PDMA_OPENED_CH   	    ((1 << UART1_RX_DMA_CH) | (1 << UART2_RX_DMA_CH))

#define UART1_PDMA_OPENED_CH_RX   	(1 << UART1_RX_DMA_CH)
#define UART2_PDMA_OPENED_CH_RX   	(1 << UART2_RX_DMA_CH)

#define PDMA_TIME                   (0x5555)
#define RXBUFSIZE                   (64)

#define PDMA_GET_TRANS_CNT(pdma,u32Ch) ((uint32_t)((pdma->DSCT[(u32Ch)].CTL&PDMA_DSCT_CTL_TXCNT_Msk) >> PDMA_DSCT_CTL_TXCNT_Pos))

typedef struct UART_packet_T
{
    uint8_t g_u8RecData[RXBUFSIZE];
    uint32_t g_u32comRbytes;
    uint32_t g_u32comRhead;
    uint32_t g_u32comRtail;
    uint32_t g_u32cntbak;    
    uint32_t g_u8PackageComplete;
    uint16_t tmp; 
    uint32_t cnt;     
} UART_packet_T;
UART_packet_T UART1_P =  
{
    {0} ,   //g_u8RecData[RXBUFSIZE]
    0,
    0,
    0,
    RXBUFSIZE / 2 - 1,  //g_u32cntbak
    0,
    0,
    0
};

UART_packet_T UART2_P =  
{
    {0} ,   //g_u8RecData[RXBUFSIZE]
    0,
    0,
    0,
    RXBUFSIZE / 2 - 1,  //g_u32cntbak
    0,
    0,
    0
};

/*_____ M A C R O S ________________________________________________________*/

/*_____ F U N C T I O N S __________________________________________________*/

void tick_counter(void)
{
	counter_tick++;
}

uint32_t get_tick(void)
{
	return (counter_tick);
}

void set_tick(uint32_t t)
{
	counter_tick = t;
}

void compare_buffer(uint8_t *src, uint8_t *des, int nBytes)
{
    uint16_t i = 0;	
	
    for (i = 0; i < nBytes; i++)
    {
        if (src[i] != des[i])
        {
            printf("error idx : %4d : 0x%2X , 0x%2X\r\n", i , src[i],des[i]);
			set_flag(flag_error , ENABLE);
        }
    }

	if (!is_flag_set(flag_error))
	{
    	printf("%s finish \r\n" , __FUNCTION__);	
		set_flag(flag_error , DISABLE);
	}

}

void reset_buffer(void *dest, unsigned int val, unsigned int size)
{
    uint8_t *pu8Dest;
//    unsigned int i;
    
    pu8Dest = (uint8_t *)dest;

	#if 1
	while (size-- > 0)
		*pu8Dest++ = val;
	#else
	memset(pu8Dest, val, size * (sizeof(pu8Dest[0]) ));
	#endif
	
}

void copy_buffer(void *dest, void *src, unsigned int size)
{
    uint8_t *pu8Src, *pu8Dest;
    unsigned int i;
    
    pu8Dest = (uint8_t *)dest;
    pu8Src  = (uint8_t *)src;


	#if 0
	  while (size--)
	    *pu8Dest++ = *pu8Src++;
	#else
    for (i = 0; i < size; i++)
        pu8Dest[i] = pu8Src[i];
	#endif
}

void dump_buffer(uint8_t *pucBuff, int nBytes)
{
    uint16_t i = 0;
    
    printf("dump_buffer : %2d\r\n" , nBytes);    
    for (i = 0 ; i < nBytes ; i++)
    {
        printf("0x%2X," , pucBuff[i]);
        if ((i+1)%8 ==0)
        {
            printf("\r\n");
        }            
    }
    printf("\r\n\r\n");
}

void  dump_buffer_hex(uint8_t *pucBuff, int nBytes)
{
    int     nIdx, i;

    nIdx = 0;
    while (nBytes > 0)
    {
        printf("0x%04X  ", nIdx);
        for (i = 0; i < 16; i++)
            printf("%02X ", pucBuff[nIdx + i]);
        printf("  ");
        for (i = 0; i < 16; i++)
        {
            if ((pucBuff[nIdx + i] >= 0x20) && (pucBuff[nIdx + i] < 127))
                printf("%c", pucBuff[nIdx + i]);
            else
                printf(".");
            nBytes--;
        }
        nIdx += 16;
        printf("\n");
    }
    printf("\n");
}

// void UART2_RX_PDMA_set(void)
// {
//     //RX	
//     PDMA_SetTransferCnt(PDMA,UART2_RX_DMA_CH, PDMA_WIDTH_8, DATA_NUM);
//     PDMA_SetTransferAddr(PDMA,UART2_RX_DMA_CH, UART2_BASE, PDMA_SAR_FIX, ((uint32_t) (&UART2_RxBuffer[0])), PDMA_DAR_INC);	
//     /* Set request source; set basic mode. */
//     PDMA_SetTransferMode(PDMA,UART2_RX_DMA_CH, PDMA_UART2_RX, FALSE, 0);

//     UART_PDMA_ENABLE(UART2,UART_INTEN_RXPDMAEN_Msk);
//     PDMA_EnableInt(PDMA, UART2_RX_DMA_CH, PDMA_INT_TRANS_DONE);    
//     PDMA_EnableInt(PDMA, UART2_RX_DMA_CH, PDMA_INT_TIMEOUT);        
// }

// void UART1_RX_PDMA_set(void)
// {
//     //RX	
//     PDMA_SetTransferCnt(PDMA,UART1_RX_DMA_CH, PDMA_WIDTH_8, DATA_NUM);
//     PDMA_SetTransferAddr(PDMA,UART1_RX_DMA_CH, UART1_BASE, PDMA_SAR_FIX, ((uint32_t) (&UART1_RxBuffer[0])), PDMA_DAR_INC);	
//     /* Set request source; set basic mode. */
//     PDMA_SetTransferMode(PDMA,UART1_RX_DMA_CH, PDMA_UART1_RX, FALSE, 0);

//     UART_PDMA_ENABLE(UART1,UART_INTEN_RXPDMAEN_Msk);
//     PDMA_EnableInt(PDMA, UART1_RX_DMA_CH, PDMA_INT_TRANS_DONE);   
//     PDMA_EnableInt(PDMA, UART1_RX_DMA_CH, PDMA_INT_TIMEOUT);         
// }


void PDMA_IRQHandler(void)
{
    uint32_t status = PDMA_GET_INT_STATUS(PDMA);

    #if defined (ENABLE_UART1) 
    UART1_P.cnt = PDMA_GET_TRANS_CNT(PDMA, UART1_RX_DMA_CH); /* channel transfer count */
    #endif

    #if defined (ENABLE_UART2) 
    UART2_P.cnt = PDMA_GET_TRANS_CNT(PDMA, UART2_RX_DMA_CH); /* channel transfer count */
    #endif

    if (status & PDMA_INTSTS_ABTIF_Msk)   /* abort */
    {
        printf("target abort interrupt !!:\r\n");
		#if 0
        PDMA_CLR_ABORT_FLAG(PDMA, PDMA_GET_ABORT_STS(PDMA));
		#else

        #if defined (ENABLE_UART1)            
        if (PDMA_GET_ABORT_STS(PDMA) & (UART1_PDMA_OPENED_CH_RX))
        {
            printf("UART1_PDMA_OPENED_CH_RX\r\n");
            PDMA_CLR_ABORT_FLAG(PDMA, (UART1_PDMA_OPENED_CH_RX));
        }
        #endif
        
        #if defined (ENABLE_UART2) 
        if (PDMA_GET_ABORT_STS(PDMA) & (UART2_PDMA_OPENED_CH_RX))
        {
            printf("UART2_PDMA_OPENED_CH_RX\r\n");
            PDMA_CLR_ABORT_FLAG(PDMA, (UART2_PDMA_OPENED_CH_RX));
        }
        #endif
        
		#endif
    }
    else if (status & PDMA_INTSTS_TDIF_Msk)     /* done */
    {
		#if 1

