released/M480BSP_UART1_UART2_PDMA/SampleCode/Template/main.c
        #if defined (ENABLE_UART1)            
        if (PDMA_GET_TD_STS(PDMA) & UART1_PDMA_OPENED_CH_RX)
        {
            PDMA_CLR_TD_FLAG(PDMA, UART1_PDMA_OPENED_CH_RX);

            /* Update receive count */
            UART1_P.g_u32comRbytes += UART1_P.g_u32cntbak + 1; /* count */
            UART1_P.g_u32comRtail = (UART1_P.g_u32comRtail + UART1_P.g_u32cntbak + 1) % RXBUFSIZE; /* index */
            UART1_P.g_u32cntbak = RXBUFSIZE / 2 - 1; /* channel cnt backup */

            UART1_P.g_u8PackageComplete = 1;
            
			set_flag(flag_UART1_RX_end,ENABLE);
        } 
        #endif

        #if defined (ENABLE_UART2) 
        if (PDMA_GET_TD_STS(PDMA) & UART2_PDMA_OPENED_CH_RX)
        {
            PDMA_CLR_TD_FLAG(PDMA, UART2_PDMA_OPENED_CH_RX);

            /* Update receive count */
            UART2_P.g_u32comRbytes += UART2_P.g_u32cntbak + 1; /* count */
            UART2_P.g_u32comRtail = (UART2_P.g_u32comRtail + UART2_P.g_u32cntbak + 1) % RXBUFSIZE; /* index */
            UART2_P.g_u32cntbak = RXBUFSIZE / 2 - 1; /* channel cnt backup */

            UART2_P.g_u8PackageComplete = 1;
            
			set_flag(flag_UART2_RX_end,ENABLE);
        } 
        #endif
		
		#else
        if((PDMA_GET_TD_STS(PDMA) & UART_PDMA_OPENED_CH) == UART_PDMA_OPENED_CH)
        {
            /* Clear PDMA transfer done interrupt flag */
            PDMA_CLR_TD_FLAG(PDMA, UART_PDMA_OPENED_CH);
			//insert process
			/*
                DISABLE TRIGGER
            */

        } 
		#endif
    }
    #if defined (ENABLE_UART1)     
    else if (status & (PDMA_INTSTS_REQTOF0_Msk))     /* Check the DMA time-out interrupt flag */
    {
        // printf("UART1_RX time-out !!\r\n");
        /* Update receive count */
        UART1_P.g_u32comRbytes += UART1_P.g_u32cntbak - UART1_P.cnt;  /* count */
        UART1_P.g_u32comRtail = (UART1_P.g_u32comRtail + UART1_P.g_u32cntbak - UART1_P.cnt) % RXBUFSIZE;  /* index */
        UART1_P.g_u32cntbak = UART1_P.cnt; /* channel cnt backup */

        UART1_P.g_u8PackageComplete = 0;

        /* restart timeout */
        PDMA_SetTimeOut(PDMA, UART1_RX_DMA_CH, DISABLE, 0);
        PDMA_CLR_TMOUT_FLAG(PDMA, UART1_RX_DMA_CH);
        PDMA_SetTimeOut(PDMA, UART1_RX_DMA_CH, ENABLE, PDMA_TIME);
    }
    #endif
    #if defined (ENABLE_UART2)     
    else if (status & (PDMA_INTSTS_REQTOF1_Msk))     /* Check the DMA time-out interrupt flag */
    {
        // printf("UART2_RX time-out !!\r\n");
        /* Update receive count */
        UART2_P.g_u32comRbytes += UART2_P.g_u32cntbak - UART2_P.cnt;  /* count */
        UART2_P.g_u32comRtail = (UART2_P.g_u32comRtail + UART2_P.g_u32cntbak - UART2_P.cnt) % RXBUFSIZE;  /* index */
        UART2_P.g_u32cntbak = UART2_P.cnt; /* channel cnt backup */

        UART2_P.g_u8PackageComplete = 0;

        /* restart timeout */
        PDMA_SetTimeOut(PDMA, UART2_RX_DMA_CH, DISABLE, 0);
        PDMA_CLR_TMOUT_FLAG(PDMA, UART2_RX_DMA_CH);
        PDMA_SetTimeOut(PDMA, UART2_RX_DMA_CH, ENABLE, PDMA_TIME);        
    }    
    #endif
    else
    {
        printf("unknown interrupt !!\r\n");
    }	
}

/*
    UART1 RX :PA2
    UART2 RX :PB0
*/
void UART1_UART2_Init(void)
{
    #if defined (ENABLE_UART1)     
    SYS_ResetModule(UART1_RST);
    UART_Open(UART1, 115200);
    #endif

    #if defined (ENABLE_UART2)     
    SYS_ResetModule(UART2_RST);    
    UART_Open(UART2, 115200);
    #endif

    #if defined (ENABLE_UART1)
    UART_PDMA_ENABLE(UART1,UART_INTEN_RXPDMAEN_Msk);
    #endif

    #if defined (ENABLE_UART2)     
    UART_PDMA_ENABLE(UART2,UART_INTEN_RXPDMAEN_Msk);
    #endif
}

void PDMA_WriteUART2SGTable(void)  //scatter-gather table */
{
    DMA_UART2DESC[UART2_RX_BUFFER01].ctl = \
                      ((RXBUFSIZE / 2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | /* Transfer count is RXBUFSIZE/2 */ \
                      PDMA_WIDTH_8 |    /* Transfer width is 8 bits */ \
                      PDMA_SAR_FIX |    /* Source increment size is  fixed(no increment) */ \
                      PDMA_DAR_INC |    /* Destination increment size is 8 bits */ \
                      PDMA_REQ_SINGLE | /* Transfer type is single transfer type */ \
                      PDMA_BURST_1 |    /* Burst size is 1. No effect in single transfer type */ \
                      PDMA_OP_SCATTER;  /* Operation mode is scatter-gather mode */
    /* Configure source address */
    DMA_UART2DESC[UART2_RX_BUFFER01].src = (uint32_t)UART2_BASE;
    /* Configure destination address */
    DMA_UART2DESC[UART2_RX_BUFFER01].dest = (uint32_t)&UART2_P.g_u8RecData[0];/*buffer 1 */
    /* Configure next descriptor table address */
    DMA_UART2DESC[UART2_RX_BUFFER01].offset = (uint32_t)&DMA_UART2DESC[UART2_RX_BUFFER02] - (PDMA->SCATBA); /* next operation table is table 2 */

    DMA_UART2DESC[UART2_RX_BUFFER02].ctl = \
                      ((RXBUFSIZE / 2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | /* Transfer count is RXBUFSIZE/2 */ \
                      PDMA_WIDTH_8 |    /* Transfer width is 8 bits */ \
                      PDMA_SAR_FIX |    /* Source increment size is fixed(no increment) */ \
                      PDMA_DAR_INC |    /* Destination increment size is 8 bits */ \
                      PDMA_REQ_SINGLE | /* Transfer type is single transfer type */ \
                      PDMA_BURST_1 |    /* Burst size is 1. No effect in single transfer type */ \
                      PDMA_OP_SCATTER;  /* Operation mode is scatter-gather mode */
    /* Configure source address */
    DMA_UART2DESC[UART2_RX_BUFFER02].src = (uint32_t)UART2_BASE;
    /* Configure destination address */
    DMA_UART2DESC[UART2_RX_BUFFER02].dest = (uint32_t)&UART2_P.g_u8RecData[RXBUFSIZE / 2] ; /* buffer 2 */
    /* Configure next descriptor table address */
    DMA_UART2DESC[UART2_RX_BUFFER02].offset = (uint32_t)&DMA_UART2DESC[UART2_RX_BUFFER01] - (PDMA->SCATBA); /* next operation table is table 1 */

}

void PDMA_WriteUART1SGTable(void)  //scatter-gather table */
{
    DMA_UART1DESC[UART1_RX_BUFFER01].ctl = \
                      ((RXBUFSIZE / 2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | /* Transfer count is RXBUFSIZE/2 */ \
                      PDMA_WIDTH_8 |    /* Transfer width is 8 bits */ \
                      PDMA_SAR_FIX |    /* Source increment size is  fixed(no increment) */ \
                      PDMA_DAR_INC |    /* Destination increment size is 8 bits */ \
                      PDMA_REQ_SINGLE | /* Transfer type is single transfer type */ \
                      PDMA_BURST_1 |    /* Burst size is 1. No effect in single transfer type */ \
                      PDMA_OP_SCATTER;  /* Operation mode is scatter-gather mode */
    /* Configure source address */
    DMA_UART1DESC[UART1_RX_BUFFER01].src = (uint32_t)UART1_BASE;
    /* Configure destination address */
    DMA_UART1DESC[UART1_RX_BUFFER01].dest = (uint32_t)&UART1_P.g_u8RecData[0];/*buffer 1 */
    /* Configure next descriptor table address */
    DMA_UART1DESC[UART1_RX_BUFFER01].offset = (uint32_t)&DMA_UART1DESC[UART1_RX_BUFFER02] - (PDMA->SCATBA); /* next operation table is table 2 */

    DMA_UART1DESC[UART1_RX_BUFFER02].ctl = \
                      ((RXBUFSIZE / 2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | /* Transfer count is RXBUFSIZE/2 */ \
                      PDMA_WIDTH_8 |    /* Transfer width is 8 bits */ \
                      PDMA_SAR_FIX |    /* Source increment size is fixed(no increment) */ \
                      PDMA_DAR_INC |    /* Destination increment size is 8 bits */ \
                      PDMA_REQ_SINGLE | /* Transfer type is single transfer type */ \
                      PDMA_BURST_1 |    /* Burst size is 1. No effect in single transfer type */ \
                      PDMA_OP_SCATTER;  /* Operation mode is scatter-gather mode */
    /* Configure source address */
    DMA_UART1DESC[UART1_RX_BUFFER02].src = (uint32_t)UART1_BASE;
    /* Configure destination address */
    DMA_UART1DESC[UART1_RX_BUFFER02].dest = (uint32_t)&UART1_P.g_u8RecData[RXBUFSIZE / 2] ; /* buffer 2 */
    /* Configure next descriptor table address */
    DMA_UART1DESC[UART1_RX_BUFFER02].offset = (uint32_t)&DMA_UART1DESC[UART1_RX_BUFFER01] - (PDMA->SCATBA); /* next operation table is table 1 */
}

