released/M480BSP_UART1_UART2_PDMA/SampleCode/Template/main.c
void UART_PDMA_Init(void)
{
	set_flag(flag_UART1_RX_end,DISABLE);
	set_flag(flag_UART2_RX_end,DISABLE);

    SYS_ResetModule(PDMA_RST);

    #if defined (ENABLE_UART1)    
    PDMA_Open(PDMA, UART1_PDMA_OPENED_CH_RX);
    #endif

    #if defined (ENABLE_UART2)     
    PDMA_Open(PDMA, UART2_PDMA_OPENED_CH_RX);
    #endif
    
    // UART1 RX
    #if 1

    #if defined (ENABLE_UART1)    
    PDMA_WriteUART1SGTable();
    PDMA_SetTransferMode(PDMA, UART1_RX_DMA_CH, PDMA_UART1_RX, TRUE, (uint32_t)&DMA_UART1DESC[UART1_RX_BUFFER01]);
    #endif

    #if defined (ENABLE_UART2)
    PDMA_WriteUART2SGTable();
    PDMA_SetTransferMode(PDMA, UART2_RX_DMA_CH, PDMA_UART2_RX, TRUE, (uint32_t)&DMA_UART2DESC[UART2_RX_BUFFER01]);

    #endif


    #else
    PDMA_SetTransferCnt(PDMA,UART1_RX_DMA_CH, PDMA_WIDTH_8, DATA_NUM);
    /* Set source/destination address and attributes */
    PDMA_SetTransferAddr(PDMA,UART1_RX_DMA_CH, UART1_BASE, PDMA_SAR_FIX, ((uint32_t) (&UART1_RxBuffer[0])), PDMA_DAR_INC);

    /* Set request source; set basic mode. */
    PDMA_SetTransferMode(PDMA,UART1_RX_DMA_CH, PDMA_UART1_RX, FALSE, 0);
    /* Single request type. */
    PDMA_SetBurstType(PDMA,UART1_RX_DMA_CH, PDMA_REQ_SINGLE, 0);
    /* Disable table interrupt */
    PDMA_DisableInt(PDMA,UART1_RX_DMA_CH, PDMA_INT_TEMPTY );//PDMA->DSCT[UART1_RX_DMA_CH].CTL |= PDMA_DSCT_CTL_TBINTDIS_Msk;

    // UART2 RX	
    PDMA_SetTransferCnt(PDMA,UART2_RX_DMA_CH, PDMA_WIDTH_8, DATA_NUM);
    /* Set source/destination address and attributes */
    PDMA_SetTransferAddr(PDMA,UART2_RX_DMA_CH, UART2_BASE, PDMA_SAR_FIX, ((uint32_t) (&UART2_RxBuffer[0])), PDMA_DAR_INC);
    /* Set request source; set basic mode. */
    PDMA_SetTransferMode(PDMA,UART2_RX_DMA_CH, PDMA_UART2_RX, FALSE, 0);
    /* Single request type. */
    PDMA_SetBurstType(PDMA,UART2_RX_DMA_CH, PDMA_REQ_SINGLE, 0);
    /* Disable table interrupt */
    PDMA_DisableInt(PDMA,UART2_RX_DMA_CH, PDMA_INT_TEMPTY );//PDMA->DSCT[UART2_RX_DMA_CH].CTL |= PDMA_DSCT_CTL_TBINTDIS_Msk;
    #endif
    /*
        UART data freq : 1.6KHz	0.625	ms

        Set PDMA CH 0/1 timeout to about 
        2 ms (5/(72M/(2^15)))
        0.56 ms (5/(72M/(2^13)))

        target (ms)	    u32TimeOutCnt	clk div	    prescale	
        2.275555556	    5	            72000000	32768	15      111
        1.137777778	    5	            72000000	16384	14      110
        0.568888889	    5	            72000000	8192	13      101
        0.284444444	    5	            72000000	4096	12      100
        0.142222222	    5	            72000000	2048	11      011
        0.071111111	    5	            72000000	1024	10      010
        0.035555556	    5	            72000000	512	    9       001
        0.017777778	    5	            72000000	256	    8       000  

    */
    // PDMA->TOUTPSC = (PDMA->TOUTPSC & (~PDMA_TOUTPSC_TOUTPSC0_Msk)) | (0x5 << PDMA_TOUTPSC_TOUTPSC0_Pos);
    PDMA_SetTimeOut(PDMA,UART1_RX_DMA_CH, ENABLE, PDMA_TIME );

    #if defined (ENABLE_UART2) 
    // PDMA->TOUTPSC = (PDMA->TOUTPSC & (~PDMA_TOUTPSC_TOUTPSC1_Msk)) | (0x5 << PDMA_TOUTPSC_TOUTPSC1_Pos);
    PDMA_SetTimeOut(PDMA,UART2_RX_DMA_CH, ENABLE, PDMA_TIME );
    #endif

    // UART_PDMA_ENABLE(UART1,UART_INTEN_RXPDMAEN_Msk);
    // UART_PDMA_ENABLE(UART2,UART_INTEN_RXPDMAEN_Msk);

    PDMA_EnableInt(PDMA, UART1_RX_DMA_CH, PDMA_INT_TRANS_DONE);
    PDMA_EnableInt(PDMA, UART1_RX_DMA_CH, PDMA_INT_TIMEOUT);
    #if defined (ENABLE_UART2)    
    PDMA_EnableInt(PDMA, UART2_RX_DMA_CH, PDMA_INT_TRANS_DONE);
    PDMA_EnableInt(PDMA, UART2_RX_DMA_CH, PDMA_INT_TIMEOUT);
    #endif
    NVIC_EnableIRQ(PDMA_IRQn);

}


void loop(void)
{

    /* Add data processing code */
    #if defined (ENABLE_UART1)     
    if (UART1_P.g_u32comRbytes)
    {        
        UART1_P.tmp = UART1_P.g_u32comRtail;

        if (UART1_P.g_u32comRhead != UART1_P.tmp)
        {
            printf("UART1:%c[0x%2X](Rbytes:%2d,Rhead:%2d,Rtail:%2d)\r\n", 
            UART1_P.g_u8RecData[UART1_P.g_u32comRhead],
            UART1_P.g_u8RecData[UART1_P.g_u32comRhead],            
            UART1_P.g_u32comRbytes,
            UART1_P.g_u32comRhead,
            UART1_P.g_u32comRtail);

            UART1_P.g_u32comRhead = (UART1_P.g_u32comRhead == (RXBUFSIZE - 1)) ? 0 : (UART1_P.g_u32comRhead + 1);
            UART1_P.g_u32comRbytes--;
        }
    }
    #endif

    #if defined (ENABLE_UART2) 
    if (UART2_P.g_u32comRbytes)
    {        
        UART2_P.tmp = UART2_P.g_u32comRtail;

        if (UART2_P.g_u32comRhead != UART2_P.tmp)
        {
            #if 1
            printf("UART2:0x%2X\r\n", UART2_P.g_u8RecData[UART2_P.g_u32comRhead]);
            #else
            printf("UART2:%c[0x%2X](Rbytes:%2d,Rhead:%2d,Rtail:%2d)\r\n", 
            UART2_P.g_u8RecData[UART2_P.g_u32comRhead],
            UART2_P.g_u8RecData[UART2_P.g_u32comRhead],            
            UART2_P.g_u32comRbytes,
            UART2_P.g_u32comRhead,
            UART2_P.g_u32comRtail);            
            #endif
            
            UART2_P.g_u32comRhead = (UART2_P.g_u32comRhead == (RXBUFSIZE - 1)) ? 0 : (UART2_P.g_u32comRhead + 1);
            UART2_P.g_u32comRbytes--;
        }
    }
    #endif   

    if (is_flag_set(flag_UART1_RX_end))
    {
        set_flag(flag_UART1_RX_end, DISABLE);

        // printf("UART1_RX : \r\n");

        // dump_buffer_hex(UART1_RxBuffer,DATA_NUM);

        // reset_buffer(UART1_RxBuffer,0x00,DATA_NUM);     
        // UART1_RX_PDMA_set();   
        
    }

    if (is_flag_set(flag_UART2_RX_end))
    {
        set_flag(flag_UART2_RX_end, DISABLE);

        // printf("UART2_RX : \r\n");

        // dump_buffer_hex(UART2_RxBuffer,DATA_NUM);

        // reset_buffer(UART2_RxBuffer,0x00,DATA_NUM);   
        // UART2_RX_PDMA_set();   
        
    }
}

void TMR1_IRQHandler(void)
{
	// static uint32_t LOG = 0;
	
    if(TIMER_GetIntFlag(TIMER1) == 1)
    {
        TIMER_ClearIntFlag(TIMER1);
		tick_counter();

		if ((get_tick() % 1000) == 0)
		{
			// printf("%s : %4d\r\n",__FUNCTION__,LOG++);
			PH0 ^= 1;
		}

		if ((get_tick() % 50) == 0)
		{

